
/*       **Задача 16:**
Напишите программу, которая принимает на вход два числа и проверяет, является ли первое число квадратом второго.    */

Console.Write($"Hello");
Console.Write("Hello");
